[
  {
    "name": "Apache Kafka",
    "ring": "High",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "description": "Apache Kafka ist ein verteiltes Streaming-System mit Open-Source-Lizenz, das für Stream-Verarbeitung, Echtzeit-Daten-Pipelines und Datenintegration im hohen Maßstab verwendet wird. Kafka wurde 2011 bei LinkedIn für den Umgang mit Echtzeit-Daten-Feeds entwickelt. Seitdem hat es sich schnell von einer Messaging-Queue zur vollwertigen Event-Streaming-Plattform entwickelt, die mehr als eine Million Nachrichten pro Sekunde bzw. Billionen von Nachrichten pro Tag verarbeiten kann."
  },
  {
    "name": "AWS",
    "ring": "High",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "description": "Amazon Web Services, auch als AWS bekannt, ist eine vom gleichnamigen Unternehmen angebotene Plattform für Cloud-Computing."
  },
  {
    "name": "Azure",
    "ring": "High",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "description": "Die Azure-Cloudplattform besteht aus mehr als 200 Produkten und Clouddiensten und wurde dafür konzipiert, Sie bei der Entwicklung neuer Lösungen zu unterstützen. So können Sie aktuelle Herausforderungen bewältigen und den Weg für die Zukunft ebnen. Sie können Anwendungen in mehreren Clouds, lokal oder am Edge entwickeln, ausführen und verwalten."
  },
  {
    "name": "Docker",
    "ring": "High",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "description": "Docker ist eine Open-Source-Plattform, die Entwicklern die Erstellung, Bereitstellung, Ausführung, Aktualisierung und Verwaltung von Containern ermöglicht. Container sind standardisierte ausführbare Komponenten, die den Anwendungsquellcode mit den Betriebssystembibliotheken und den Abhängigkeiten kombinieren, die zur Ausführung des Codes in jeder beliebigen Umgebung erforderlich sind."
  },
  {
    "name": "GitHub Actions",
    "ring": "High",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "description": "GitHub Actions ist eine Plattform für Continuous Integration und Continuous Delivery (CI/CD), mit der du deine Build-, Test- und Bereitstellungspipeline automatisieren kannst. Man kann Workflows erstellen, mit denen man alle Pull Requests für das Repository erstellen und testen sowie gemergte Pull Requests für die Produktion bereitstellen kann."
  },
  {
    "name": "Gitlab CI/CD",
    "ring": "High",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "description": "GitLab bietet einem die Möglichkeit, mit Continuous Integration/Continuous Delivery Automatisierung in seine Abläufe zu integrieren. Die CI/CD Pipelines können direkt im Projekt konfiguriert und ausgeführt werden. Somit sind alle wichtigen Daten an einem Ort. Mit der Pipeline können Tests und Deployments automatisch ausgeführt werden."
  },
  {
    "name": "Redis",
    "ring": "High",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "description": "Redis ist ein schneller, Open-Source-In-Memory-Schlüsselwert-Datenstrukturspeicher. Redis bietet eine Reihe von vielseitigen In-Memory-Datenstrukturen, die es Ihnen ermöglichen, verschiedene benutzerdefinierte Anwendungen problemlos zu erstellen. Häufige Anwendungsfälle für Redis sind u. a. Caching, Sitzungsverwaltung, Pub/Sub und Bestenlisten. Redis ist heute der beliebteste Schlüsselwertspeicher. Er ist BSD-lizenziert, wurde im optimierten C-Code geschrieben und unterstützt mehrere Entwicklungssprachen. Redis ist ein Akronym für REmote DIctionary Server. Aufgrund der Geschwindigkeit und Benutzerfreundlichkeit ist Redis eine beliebte Wahl für Web-, Mobil-, Spiele-, Ad-Tech- und IoT -Anwendungen, die eine bestmögliche Leistung erfordern."
  },
  {
    "name": "WIZ",
    "ring": "Dev",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "description": "WIZ ist ein weiterer Anwärter in der reifenden Cloud-Sicherheitsplattform-Landschaft, der seinen Benutzern ermöglicht, Sicherheitsrisiken und -bedrohungen in einer Plattform zu verhindern, zu erkennen und darauf zu reagieren. Wiz kann Fehlkonfigurationen, Schwachstellen und durchgesickerte Geheimnisse sowohl in Artefakten, die noch nicht in Live-Umgebungen bereitgestellt wurden (Containerbilder, Infrastrukturcode), als auch in Live-Workloads (Container, VMs und Cloud-Dienste) erkennen und darauf hinweisen. Es kontextualisiert auch Erkenntnisse auf die spezifische Cloud-Landschaft des Kunden, um Reaktionsteams ein besseres Verständnis des Problems zu ermöglichen und Abhilfemaßnahmen zu priorisieren."
  },
  {
    "name": "Prisma",
    "ring": "Dev",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "Prisma ist ein Open-Source-basiertes Datenbank-Toolkit. Es besteht aus drei Haupttools: Prisma Client: Ein automatisch generierter und typensicherer Query Builder für Node.js und TypeScript. Prisma Migrate: Ein deklaratives Modellierungs- und Migrationssystem für Daten. Prisma Studio: Eine GUI zum Anzeigen und Bearbeiten von Daten in Ihrer Datenbank."
  },
  {
    "name": "Dynatrace",
    "ring": "Low",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "Dynatrace überwacht die gesamte Infrastruktur, unabhängig von Standort und Technologie. Sowohl Server, Netzwerk, Virtualisierungen als auch Microservices und Container werden automatisch überwacht. Dabei spielt es keine Rolle, ob sich diese in einer Private-, Public- oder Hybrid-Cloud-Lösung befinden."
  },
  {
    "name": "Terraform",
    "ring": "High",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "Terraform ist ein quelloffenes „Infrastructure as Code“-Tool, das von HashiCorp entwickelt wurde. Terraform ist ein deklaratives Codierungstool, das es Entwicklern ermöglicht, mithilfe einer übergeordneten Konfigurationssprache namens HCL (HashiCorp Configuration Language) den gewünschten „Endzustand“ einer Cloud- oder lokalen Infrastruktur für die Ausführung einer Anwendung zu beschreiben. Es generiert dann einen Plan für das Erreichen dieses Endstatus und führt den Plan zur Bereitstellung der Infrastruktur aus."
  },
  {
    "name": "Terragrunt",
    "ring": "High",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "Terragrunt ist ein Open-Source-Tool, das auf HashiCorp Terraform aufbaut und dazu dient, die Verwaltung von Terraform-Konfigurationen zu vereinfachen und zu verbessern. Terraform ist ein populäres Tool für das Infrastruktur-As-Code (IaC), das es ermöglicht, die Infrastrukturressourcen in verschiedenen Cloud-Plattformen und On-Premises-Infrastrukturen zu definieren, zu verwalten und zu versionieren."
  },
  {
    "name": "Terratest",
    "ring": "Dev",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "Terratest ist eine Golang-Bibliothek, die das Schreiben automatisierter Tests für Infrastrukturcode erleichtert. Ein Testlauf erstellt echte Infrastrukturkomponenten (wie Server, Firewalls oder Load Balancer), setzt Anwendungen auf ihnen ein und validiert das erwartete Verhalten mit Terratest. Am Ende des Tests kann Terratest die Apps undeployen und Ressourcen aufräumen. Dies macht es weitgehend nützlich für End-to-End-Tests Ihrer Infrastruktur in einer realen Umgebung."
  },
  {
    "name": "GitHub",
    "ring": "High",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "GitHub ist ein Onlinedienst zur Softwareentwicklung und Versionsverwaltung für Softwareprojekte auf Git-Basis."
  },
  {
    "name": "Gitlab",
    "ring": "High",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "GitLab ist eine On-Premise-Git-Repository-Hosting-Plattform, die proprietären Softwareentwicklungsteams den vertrauten und allgegenwärtigen Workflow bietet, den gehostete Versionskontrolldienste wie GitHub und BitBucket OSS-Entwicklern zur Verfügung stellen. Obwohl es als kostenlose Community-Edition-Software verfügbar ist, bietet die kommerzielle Enterprise-Option Unterstützung und tiefe Integration mit LDAP-Servern."
  },
  {
    "name": "Grafana",
    "ring": "Dev",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "Grafana ist eine Open-Source-Software, mit der sich plattformübergreifend Metriken und Daten aus Anwendungen analysieren lassen."
  },
  {
    "name": "Maven",
    "ring": "Dev",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "Maven ist ein Build-Tool der Apache Software Foundation für die Projektverwaltung. Entwickler können damit Java-Projekte automatisieren. Maven ist ein Teil der Apache Software Foundation und wird von dieser gehostet. Das Tool ist aus einem Teil des Jakarta-Projekts hervorgegangen."
  },
  {
    "name": "Git",
    "ring": "High",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "Git ist eine freie Software zur verteilten Versionsverwaltung von Dateien, die durch Linus Torvalds initiiert wurde."
  },
  {
    "name": "Sonatype Nexus Repository",
    "ring": "High",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "Zentrale Lösung zur Ablage von Komponenten (z.B. Binaries, Pakete und Build-Artefakte). Nexus Repository deckt Funktionen wie z.B. Hochverfügbarkeit, Replikation und Staging von Komponenten ab."
  },
  {
    "name": "SonarQube",
    "ring": "High",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "SonarQube ist eine Open-Source-Plattform für statische Codeanalysen und wird zur Prüfung der technischen Qualität von Quellcode eingesetzt."
  },
  {
    "name": "Nx",
    "ring": "High",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "Ein NX-Monorepo ist eine weit verbreitete Architektur für moderne Webentwicklungsprojekte. Es bietet eine einfachere Wartbarkeit und Skalierbarkeit, indem es eine einheitliche Struktur und Werkzeuge für alle Projekte innerhalb des Monorepos bereitstellt."
  }
]
